Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2064DAA169.atdf
         <register caption="Ethernet Controller Status Register" name="ETHSTAT" offset="0xe0" rw="RW" size="4">
            <bitfield caption="Receive Busy bit" mask="0x00000020" name="RXBUSY" values="ETHSTAT__RXBUSY" />
            <bitfield caption="Transmit Busy bit" mask="0x00000040" name="TXBUSY" values="ETHSTAT__TXBUSY" />
            <bitfield mask="0x00000080" name="BUSY" />
            <bitfield mask="0x00FF0000" name="BUFCNT" />
         </register>
         <register caption="Ethernet Controller Receive Overflow Statistics Register" name="ETHRXOVFLOW" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RXOVFLWCNT" />
         </register>
         <register caption="Ethernet Controller Frames Transmitted OK Statistics Register" name="ETHFRMTXOK" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FRMTXOKCNT" />
         </register>
         <register caption="Ethernet Controller Single Collision Frames Statistics Register" name="ETHSCOLFRM" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SCOLFRMCNT" />
         </register>
         <register caption="Ethernet Controller Multiple Collision Frames Statistics Register" name="ETHMCOLFRM" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="MCOLFRMCNT" />
         </register>
         <register caption="Ethernet Controller Frames Received OK Statistics Register" name="ETHFRMRXOK" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FRMRXOKCNT" />
         </register>
         <register caption="Ethernet Controller Frame Check Sequence Error Statistics Register" name="ETHFCSERR" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FCSERRCNT" />
         </register>
         <register caption="Ethernet Controller Alignment Errors Statistics Register" name="ETHALGNERR" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALGNERRCNT" />
         </register>
         <register caption="Ethernet Controller MAC Configuration 1 Register" name="EMAC1CFG1" offset="0x200" rw="RW" size="4">
            <bitfield caption="MAC Receive Enable bit" mask="0x00000001" name="RXENABLE" values="EMAC1CFG1__RXENABLE" />
            <bitfield caption="MAC Pass all Receive Frames bit" mask="0x00000002" name="PASSALL" values="EMAC1CFG1__PASSALL" />
            <bitfield caption="MAC RX Flow Control bit" mask="0x00000004" name="RXPAUSE" values="EMAC1CFG1__RXPAUSE" />
            <bitfield caption="MAC TX Flow Control bit" mask="0x00000008" name="TXPAUSE" values="EMAC1CFG1__TXPAUSE" />
            <bitfield caption="MAC Loopback mode bit" mask="0x00000010" name="LOOPBACK" values="EMAC1CFG1__LOOPBACK" />
            <bitfield mask="0x00000100" name="RESETTFUN" />
            <bitfield mask="0x00000200" name="RESETTMCS" />
            <bitfield mask="0x00000400" name="RESETRFUN" />
            <bitfield mask="0x00000800" name="RESETRMCS" />
            <bitfield mask="0x00004000" name="SIMRESET" />
            <bitfield mask="0x00008000" name="SOFTRESET" />
         </register>
         <register caption="Ethernet Controller MAC Configuration 2 Register" name="EMAC1CFG2" offset="0x210" rw="RW" size="4">
            <bitfield caption="Full-Duplex Operation bit" mask="0x00000001" name="FULLDPLX" values="EMAC1CFG2__FULLDPLX" />
            <bitfield caption="Frame Length checking bit" mask="0x00000002" name="LENGTHCK" values="EMAC1CFG2__LENGTHCK" />
            <bitfield caption="Huge Frame enable bit" mask="0x00000004" name="HUGEFRM" values="EMAC1CFG2__HUGEFRM" />
            <bitfield caption="Delayed CRC bit" mask="0x00000008" name="DELAYCRC" values="EMAC1CFG2__DELAYCRC" />
            <bitfield caption="CRC Enable1 bit" mask="0x00000010" name="CRCENABLE" values="EMAC1CFG2__CRCENABLE" />
            <bitfield caption="Pad/CRC Enable bit" mask="0x00000020" name="PADENABLE" values="EMAC1CFG2__PADENABLE" />
            <bitfield caption="VLAN Pad Enable bit" mask="0x00000040" name="VLANPAD" values="EMAC1CFG2__VLANPAD" />
            <bitfield caption="Automatic Detect Pad Enable bit" mask="0x00000080" name="AUTOPAD" values="EMAC1CFG2__AUTOPAD" />
            <bitfield caption="Pure Preamble Enforcement bit" mask="0x00000100" name="PUREPRE" values="EMAC1CFG2__PUREPRE" />
            <bitfield caption="Long Preamble Enforcement bit" mask="0x00000200" name="LONGPRE" values="EMAC1CFG2__LONGPRE" />
            <bitfield caption="No Backoff bit" mask="0x00001000" name="NOBKOFF" values="EMAC1CFG2__NOBKOFF" />
            <bitfield caption="Backpressure/No Backoff bit" mask="0x00002000" name="BPNOBKOFF" values="EMAC1CFG2__BPNOBKOFF" />
            <bitfield caption="Excess Defer bit" mask="0x00004000" name="EXCESSDER" values="EMAC1CFG2__EXCESSDER" />
         </register>
         <register caption="Ethernet Controller MAC Back-to-Back Interpacket Gap Register" name="EMAC1IPGT" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="B2BIPKTGP" />
         </register>
         <register caption="Ethernet Controller MAC Non-Back-to-Back Interpacket Gap Register" name="EMAC1IPGR" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="NB2BIPKTGP2" />
            <bitfield mask="0x00007F00" name="NB2BIPKTGP1" />
         </register>
         <register caption="Ethernet Controller MAC Collision Window/Retry Limit Register" name="EMAC1CLRT" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RETX" />
            <bitfield mask="0x00003F00" name="CWINDOW" />
         </register>
         <register caption="Ethernet Controller MAC Maximum Frame Length Register" name="EMAC1MAXF" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="MACMAXF" />
         </register>
         <register caption="Ethernet Controller MAC PHY Support Register" name="EMAC1SUPP" offset="0x260" rw="RW" size="4">
            <bitfield caption="RMII Speed bit" mask="0x00000100" name="SPEEDRMII" values="EMAC1SUPP__SPEEDRMII" />
            <bitfield caption="Reset RMII Logic bit" mask="0x00000800" name="RESETRMII" values="EMAC1SUPP__RESETRMII" />
         </register>
         <register caption="Ethernet Controller MAC Test Register" name="EMAC1TEST" offset="0x270" rw="RW" size="4">
            <bitfield caption="Shortcut PAUSE Quanta bit" mask="0x00000001" name="SHRTQNTA" values="EMAC1TEST__SHRTQNTA" />
            <bitfield caption="Test PAUSE bit" mask="0x00000002" name="TESTPAUSE" values="EMAC1TEST__TESTPAUSE" />
            <bitfield caption="Test Backpressure bit" mask="0x00000004" name="TESTBP" values="EMAC1TEST__TESTBP" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Configuration Register" name="EMAC1MCFG" offset="0x280" rw="RW" size="4">
            <bitfield caption="Scan Increment bit" mask="0x00000001" name="SCANINC" values="EMAC1MCFG__SCANINC" />
            <bitfield caption="Suppress Preamble bit" mask="0x00000002" name="NOPRE" values="EMAC1MCFG__NOPRE" />
            <bitfield mask="0x0000003C" name="CLKSEL" />
            <bitfield caption="Test Reset MII Management bit" mask="0x00008000" name="RESETMGMT" values="EMAC1MCFG__RESETMGMT" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Command Register" name="EMAC1MCMD" offset="0x290" rw="RW" size="4">
            <bitfield caption="MII Management Read Command bit" mask="0x00000001" name="READ" values="EMAC1MCMD__READ" />
            <bitfield caption="MII Management Scan Mode bit" mask="0x00000002" name="SCAN" values="EMAC1MCMD__SCAN" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Address Register" name="EMAC1MADR" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="REGADDR" />
            <bitfield mask="0x00001F00" name="PHYADDR" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Write Data Register" name="EMAC1MWTD" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="MWTD" />
         </register>
         <register caption="Ethernet Controller MAC MII Management Read Data Register" name="EMAC1MRDD" offset="0x2c0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="MRDD" />
         </register>
